HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 3190, TIM4 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM4_CH3_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103190u)

/** \brief 3194, TIM4 Channel 3 TDU Counter Register */
#define GTM_TIM4_CH3_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103194u)

/** \brief 3198, TIM4 Channel 3 TDU Control Register */
#define GTM_TIM4_CH3_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103198u)

/** \brief 319C, TIM4 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM4_CH3_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010319Cu)

/** \brief 31A0, TIM4 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM4_CH3_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01031A0u)

/** \brief 31A4, TIM4 Channel 3 Control Register */
#define GTM_TIM4_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01031A4u)

/** \brief 31A8, TIM4 Channel 3 Extended Control Register */
#define GTM_TIM4_CH3_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01031A8u)

/** \brief 31AC, TIM4 Channel 3 Interrupt Notification Register */
#define GTM_TIM4_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01031ACu)

/** \brief 31B0, TIM4 Channel 3 Interrupt Enable Register */
#define GTM_TIM4_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01031B0u)

/** \brief 31B4, TIM4 Channel 3 Force Interrupt Register */
#define GTM_TIM4_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01031B4u)

/** \brief 31B8, TIM4 Channel 3 Interrupt Mode Configuration Register */
#define GTM_TIM4_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01031B8u)

/** \brief 31BC, TIM4 Channel 3 Error Interrupt Enable Register */
#define GTM_TIM4_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01031BCu)

/** \brief 3200, TIM4 Channel 4 General Purpose 0 Register */
#define GTM_TIM4_CH4_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103200u)

/** \brief 3204, TIM4 Channel 4 General Purpose 1 Register */
#define GTM_TIM4_CH4_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103204u)

/** \brief 3208, TIM4 Channel 4 SMU Counter Register */
#define GTM_TIM4_CH4_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103208u)

/** \brief 320C, TIM4 Channel 4 SMU Edge Counter Register */
#define GTM_TIM4_CH4_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010320Cu)

/** \brief 3210, TIM4 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM4_CH4_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103210u)

/** \brief 3214, TIM4 Channel 4 TDU Counter Register */
#define GTM_TIM4_CH4_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103214u)

/** \brief 3218, TIM4 Channel 4 TDU Control Register */
#define GTM_TIM4_CH4_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103218u)

/** \brief 321C, TIM4 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM4_CH4_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010321Cu)

/** \brief 3220, TIM4 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM4_CH4_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103220u)

/** \brief 3224, TIM4 Channel 4 Control Register */
#define GTM_TIM4_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103224u)

/** \brief 3228, TIM4 Channel 4 Extended Control Register */
#define GTM_TIM4_CH4_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103228u)

/** \brief 322C, TIM4 Channel 4 Interrupt Notification Register */
#define GTM_TIM4_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010322Cu)

/** \brief 3230, TIM4 Channel 4 Interrupt Enable Register */
#define GTM_TIM4_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103230u)

/** \brief 3234, TIM4 Channel 4 Force Interrupt Register */
#define GTM_TIM4_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103234u)

/** \brief 3238, TIM4 Channel 4 Interrupt Mode Configuration Register */
#define GTM_TIM4_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103238u)

/** \brief 323C, TIM4 Channel 4 Error Interrupt Enable Register */
#define GTM_TIM4_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010323Cu)

/** \brief 3280, TIM4 Channel 5 General Purpose 0 Register */
#define GTM_TIM4_CH5_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103280u)

/** \brief 3284, TIM4 Channel 5 General Purpose 1 Register */
#define GTM_TIM4_CH5_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103284u)

/** \brief 3288, TIM4 Channel 5 SMU Counter Register */
#define GTM_TIM4_CH5_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103288u)

/** \brief 328C, TIM4 Channel 5 SMU Edge Counter Register */
#define GTM_TIM4_CH5_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010328Cu)

/** \brief 3290, TIM4 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM4_CH5_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103290u)

/** \brief 3294, TIM4 Channel 5 TDU Counter Register */
#define GTM_TIM4_CH5_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103294u)

/** \brief 3298, TIM4 Channel 5 TDU Control Register */
#define GTM_TIM4_CH5_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103298u)

/** \brief 329C, TIM4 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM4_CH5_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010329Cu)

/** \brief 32A0, TIM4 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM4_CH5_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01032A0u)

/** \brief 32A4, TIM4 Channel 5 Control Register */
#define GTM_TIM4_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01032A4u)

/** \brief 32A8, TIM4 Channel 5 Extended Control Register */
#define GTM_TIM4_CH5_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01032A8u)

/** \brief 32AC, TIM4 Channel 5 Interrupt Notification Register */
#define GTM_TIM4_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01032ACu)

