HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 3920, TIM5 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM5_CH2_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103920u)

/** \brief 3924, TIM5 Channel 2 Control Register */
#define GTM_TIM5_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103924u)

/** \brief 3928, TIM5 Channel 2 Extended Control Register */
#define GTM_TIM5_CH2_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103928u)

/** \brief 392C, TIM5 Channel 2 Interrupt Notification Register */
#define GTM_TIM5_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010392Cu)

/** \brief 3930, TIM5 Channel 2 Interrupt Enable Register */
#define GTM_TIM5_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103930u)

/** \brief 3934, TIM5 Channel 2 Force Interrupt Register */
#define GTM_TIM5_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103934u)

/** \brief 3938, TIM5 Channel 2 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103938u)

/** \brief 393C, TIM5 Channel 2 Error Interrupt Enable Register */
#define GTM_TIM5_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010393Cu)

/** \brief 3980, TIM5 Channel 3 General Purpose 0 Register */
#define GTM_TIM5_CH3_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103980u)

/** \brief 3984, TIM5 Channel 3 General Purpose 1 Register */
#define GTM_TIM5_CH3_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103984u)

/** \brief 3988, TIM5 Channel 3 SMU Counter Register */
#define GTM_TIM5_CH3_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103988u)

/** \brief 398C, TIM5 Channel 3 SMU Edge Counter Register */
#define GTM_TIM5_CH3_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010398Cu)

/** \brief 3990, TIM5 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM5_CH3_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103990u)

/** \brief 3994, TIM5 Channel 3 TDU Counter Register */
#define GTM_TIM5_CH3_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103994u)

/** \brief 3998, TIM5 Channel 3 TDU Control Register */
#define GTM_TIM5_CH3_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103998u)

/** \brief 399C, TIM5 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM5_CH3_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010399Cu)

/** \brief 39A0, TIM5 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM5_CH3_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01039A0u)

/** \brief 39A4, TIM5 Channel 3 Control Register */
#define GTM_TIM5_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01039A4u)

/** \brief 39A8, TIM5 Channel 3 Extended Control Register */
#define GTM_TIM5_CH3_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01039A8u)

/** \brief 39AC, TIM5 Channel 3 Interrupt Notification Register */
#define GTM_TIM5_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01039ACu)

/** \brief 39B0, TIM5 Channel 3 Interrupt Enable Register */
#define GTM_TIM5_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01039B0u)

/** \brief 39B4, TIM5 Channel 3 Force Interrupt Register */
#define GTM_TIM5_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01039B4u)

/** \brief 39B8, TIM5 Channel 3 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01039B8u)

/** \brief 39BC, TIM5 Channel 3 Error Interrupt Enable Register */
#define GTM_TIM5_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01039BCu)

/** \brief 3A00, TIM5 Channel 4 General Purpose 0 Register */
#define GTM_TIM5_CH4_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103A00u)

/** \brief 3A04, TIM5 Channel 4 General Purpose 1 Register */
#define GTM_TIM5_CH4_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103A04u)

/** \brief 3A08, TIM5 Channel 4 SMU Counter Register */
#define GTM_TIM5_CH4_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103A08u)

/** \brief 3A0C, TIM5 Channel 4 SMU Edge Counter Register */
#define GTM_TIM5_CH4_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0103A0Cu)

/** \brief 3A10, TIM5 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM5_CH4_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103A10u)

/** \brief 3A14, TIM5 Channel 4 TDU Counter Register */
#define GTM_TIM5_CH4_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103A14u)

/** \brief 3A18, TIM5 Channel 4 TDU Control Register */
#define GTM_TIM5_CH4_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103A18u)

/** \brief 3A1C, TIM5 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM5_CH4_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0103A1Cu)

/** \brief 3A20, TIM5 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM5_CH4_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103A20u)

/** \brief 3A24, TIM5 Channel 4 Control Register */
#define GTM_TIM5_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103A24u)

/** \brief 3A28, TIM5 Channel 4 Extended Control Register */
#define GTM_TIM5_CH4_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103A28u)

/** \brief 3A2C, TIM5 Channel 4 Interrupt Notification Register */
#define GTM_TIM5_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0103A2Cu)

/** \brief 3A30, TIM5 Channel 4 Interrupt Enable Register */
#define GTM_TIM5_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103A30u)

/** \brief 3A34, TIM5 Channel 4 Force Interrupt Register */
#define GTM_TIM5_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103A34u)

/** \brief 3A38, TIM5 Channel 4 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103A38u)

/** \brief 3A3C, TIM5 Channel 4 Error Interrupt Enable Register */
#define GTM_TIM5_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0103A3Cu)

/** \brief 3A80, TIM5 Channel 5 General Purpose 0 Register */
#define GTM_TIM5_CH5_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103A80u)

/** \brief 3A84, TIM5 Channel 5 General Purpose 1 Register */
#define GTM_TIM5_CH5_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103A84u)

/** \brief 3A88, TIM5 Channel 5 SMU Counter Register */
#define GTM_TIM5_CH5_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103A88u)

/** \brief 3A8C, TIM5 Channel 5 SMU Edge Counter Register */
#define GTM_TIM5_CH5_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0103A8Cu)

/** \brief 3A90, TIM5 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM5_CH5_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103A90u)

/** \brief 3A94, TIM5 Channel 5 TDU Counter Register */
#define GTM_TIM5_CH5_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103A94u)

/** \brief 3A98, TIM5 Channel 5 TDU Control Register */
#define GTM_TIM5_CH5_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103A98u)

