HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 3A9C, TIM5 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM5_CH5_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0103A9Cu)

/** \brief 3AA0, TIM5 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM5_CH5_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103AA0u)

/** \brief 3AA4, TIM5 Channel 5 Control Register */
#define GTM_TIM5_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103AA4u)

/** \brief 3AA8, TIM5 Channel 5 Extended Control Register */
#define GTM_TIM5_CH5_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103AA8u)

/** \brief 3AAC, TIM5 Channel 5 Interrupt Notification Register */
#define GTM_TIM5_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0103AACu)

/** \brief 3AB0, TIM5 Channel 5 Interrupt Enable Register */
#define GTM_TIM5_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103AB0u)

/** \brief 3AB4, TIM5 Channel 5 Force Interrupt Register */
#define GTM_TIM5_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103AB4u)

/** \brief 3AB8, TIM5 Channel 5 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103AB8u)

/** \brief 3ABC, TIM5 Channel 5 Error Interrupt Enable Register */
#define GTM_TIM5_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0103ABCu)

/** \brief 3B00, TIM5 Channel 6 General Purpose 0 Register */
#define GTM_TIM5_CH6_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103B00u)

/** \brief 3B04, TIM5 Channel 6 General Purpose 1 Register */
#define GTM_TIM5_CH6_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103B04u)

/** \brief 3B08, TIM5 Channel 6 SMU Counter Register */
#define GTM_TIM5_CH6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103B08u)

/** \brief 3B0C, TIM5 Channel 6 SMU Edge Counter Register */
#define GTM_TIM5_CH6_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0103B0Cu)

/** \brief 3B10, TIM5 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM5_CH6_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103B10u)

/** \brief 3B14, TIM5 Channel 6 TDU Counter Register */
#define GTM_TIM5_CH6_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103B14u)

/** \brief 3B18, TIM5 Channel 6 TDU Control Register */
#define GTM_TIM5_CH6_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103B18u)

/** \brief 3B1C, TIM5 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM5_CH6_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0103B1Cu)

/** \brief 3B20, TIM5 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM5_CH6_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103B20u)

/** \brief 3B24, TIM5 Channel 6 Control Register */
#define GTM_TIM5_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103B24u)

/** \brief 3B28, TIM5 Channel 6 Extended Control Register */
#define GTM_TIM5_CH6_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103B28u)

/** \brief 3B2C, TIM5 Channel 6 Interrupt Notification Register */
#define GTM_TIM5_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0103B2Cu)

/** \brief 3B30, TIM5 Channel 6 Interrupt Enable Register */
#define GTM_TIM5_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103B30u)

/** \brief 3B34, TIM5 Channel 6 Force Interrupt Register */
#define GTM_TIM5_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103B34u)

/** \brief 3B38, TIM5 Channel 6 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103B38u)

/** \brief 3B3C, TIM5 Channel 6 Error Interrupt Enable Register */
#define GTM_TIM5_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0103B3Cu)

/** \brief 3B80, TIM5 Channel 7 General Purpose 0 Register */
#define GTM_TIM5_CH7_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103B80u)

/** \brief 3B84, TIM5 Channel 7 General Purpose 1 Register */
#define GTM_TIM5_CH7_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103B84u)

/** \brief 3B88, TIM5 Channel 7 SMU Counter Register */
#define GTM_TIM5_CH7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103B88u)

/** \brief 3B8C, TIM5 Channel 7 SMU Edge Counter Register */
#define GTM_TIM5_CH7_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0103B8Cu)

/** \brief 3B90, TIM5 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM5_CH7_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103B90u)

/** \brief 3B94, TIM5 Channel 7 TDU Counter Register */
#define GTM_TIM5_CH7_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103B94u)

/** \brief 3B98, TIM5 Channel 7 TDU Control Register */
#define GTM_TIM5_CH7_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103B98u)

/** \brief 3B9C, TIM5 Channel 7 Filter Parameter 0 Register */
#define GTM_TIM5_CH7_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0103B9Cu)

/** \brief 3BA0, TIM5 Channel 7 Filter Parameter 1 Register */
#define GTM_TIM5_CH7_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103BA0u)

/** \brief 3BA4, TIM5 Channel 7 Control Register */
#define GTM_TIM5_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103BA4u)

/** \brief 3BA8, TIM5 Channel 7 Extended Control Register */
#define GTM_TIM5_CH7_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103BA8u)

/** \brief 3BAC, TIM5 Channel 7 Interrupt Notification Register */
#define GTM_TIM5_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0103BACu)

/** \brief 3BB0, TIM5 Channel 7 Interrupt Enable Register */
#define GTM_TIM5_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103BB0u)

