HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 9844, TOM3 Channel 1 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109844u)

/** \brief 9848, TOM3 Channel 1 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109848u)

/** \brief 984C, TOM3 Channel 1 CCU0 Compare Register */
#define GTM_TOM3_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010984Cu)

/** \brief 9850, TOM3 Channel 1 CCU1 Compare Register */
#define GTM_TOM3_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109850u)

/** \brief 9854, TOM3 Channel 1 CCU0 Counter Register */
#define GTM_TOM3_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109854u)

/** \brief 9858, TOM3 Channel 1 Status Register */
#define GTM_TOM3_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109858u)

/** \brief 985C, TOM3 Channel 1 Interrupt Notification Register */
#define GTM_TOM3_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010985Cu)

/** \brief 9860, TOM3 Channel 1 Interrupt Enable Register */
#define GTM_TOM3_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109860u)

/** \brief 9864, TOM3 Channel 1 Force Interrupt Register */
#define GTM_TOM3_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109864u)

/** \brief 9868, TOM3 Channel 1 Interrupt Mode Register */
#define GTM_TOM3_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109868u)

/** \brief 9870, TOM3 TGC0 Enable/Disable Control Register */
#define GTM_TOM3_TGC0_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF0109870u)

/** \brief 9874, TOM3 TGC0 Enable/Disable Status Register */
#define GTM_TOM3_TGC0_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF0109874u)

/** \brief 9878, TOM3 TGC0 Output Enable Control Register */
#define GTM_TOM3_TGC0_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF0109878u)

/** \brief 987C, TOM3 TGC0 Output Enable Status Register */
#define GTM_TOM3_TGC0_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF010987Cu)

/** \brief 9880, TOM3 Channel 2 Control Register */
#define GTM_TOM3_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109880u)

/** \brief 9884, TOM3 Channel 2 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109884u)

/** \brief 9888, TOM3 Channel 2 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109888u)

/** \brief 988C, TOM3 Channel 2 CCU0 Compare Register */
#define GTM_TOM3_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010988Cu)

/** \brief 9890, TOM3 Channel 2 CCU1 Compare Register */
#define GTM_TOM3_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109890u)

/** \brief 9894, TOM3 Channel 2 CCU0 Counter Register */
#define GTM_TOM3_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109894u)

/** \brief 9898, TOM3 Channel 2 Status Register */
#define GTM_TOM3_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109898u)

/** \brief 989C, TOM3 Channel 2 Interrupt Notification Register */
#define GTM_TOM3_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010989Cu)

/** \brief 98A0, TOM3 Channel 2 Interrupt Enable Register */
#define GTM_TOM3_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01098A0u)

/** \brief 98A4, TOM3 Channel 2 Force Interrupt Register */
#define GTM_TOM3_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01098A4u)

/** \brief 98A8, TOM3 Channel 2 Interrupt Mode Register */
#define GTM_TOM3_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01098A8u)

/** \brief 98C0, TOM3 Channel 3 Control Register */
#define GTM_TOM3_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01098C0u)

/** \brief 98C4, TOM3 Channel 3 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01098C4u)

/** \brief 98C8, TOM3 Channel 3 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01098C8u)

/** \brief 98CC, TOM3 Channel 3 CCU0 Compare Register */
#define GTM_TOM3_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01098CCu)

/** \brief 98D0, TOM3 Channel 3 CCU1 Compare Register */
#define GTM_TOM3_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01098D0u)

/** \brief 98D4, TOM3 Channel 3 CCU0 Counter Register */
#define GTM_TOM3_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01098D4u)

/** \brief 98D8, TOM3 Channel 3 Status Register */
#define GTM_TOM3_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01098D8u)

/** \brief 98DC, TOM3 Channel 3 Interrupt Notification Register */
#define GTM_TOM3_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01098DCu)

/** \brief 98E0, TOM3 Channel 3 Interrupt Enable Register */
#define GTM_TOM3_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01098E0u)

/** \brief 98E4, TOM3 Channel 3 Force Interrupt Register */
#define GTM_TOM3_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01098E4u)

/** \brief 98E8, TOM3 Channel 3 Interrupt Mode Register */
#define GTM_TOM3_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01098E8u)

/** \brief 9900, TOM3 Channel 4 Control Register */
#define GTM_TOM3_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109900u)

/** \brief 9904, TOM3 Channel 4 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109904u)

/** \brief 9908, TOM3 Channel 4 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109908u)

/** \brief 990C, TOM3 Channel 4 CCU0 Compare Register */
#define GTM_TOM3_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010990Cu)

/** \brief 9910, TOM3 Channel 4 CCU1 Compare Register */
#define GTM_TOM3_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109910u)

/** \brief 9914, TOM3 Channel 4 CCU0 Counter Register */
#define GTM_TOM3_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109914u)

/** \brief 9918, TOM3 Channel 4 Status Register */
#define GTM_TOM3_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109918u)

/** \brief 991C, TOM3 Channel 4 Interrupt Notification Register */
#define GTM_TOM3_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010991Cu)

/** \brief 9920, TOM3 Channel 4 Interrupt Enable Register */
#define GTM_TOM3_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109920u)

/** \brief 9924, TOM3 Channel 4 Force Interrupt Register */
#define GTM_TOM3_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109924u)

