HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 9A28, TOM3 Channel 8 Interrupt Mode Register */
#define GTM_TOM3_CH8_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109A28u)

/** \brief 9A30, TOM3 TGC1 Global Control Register */
#define GTM_TOM3_TGC1_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF0109A30u)

/** \brief 9A34, TOM3 TGC1 Action Time Base Register */
#define GTM_TOM3_TGC1_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF0109A34u)

/** \brief 9A38, TOM3 TGC1 Force Update Control Register */
#define GTM_TOM3_TGC1_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF0109A38u)

/** \brief 9A3C, TOM3 TGC1 Internal Trigger Control Register */
#define GTM_TOM3_TGC1_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF0109A3Cu)

/** \brief 9A40, TOM3 Channel 9 Control Register */
#define GTM_TOM3_CH9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109A40u)

/** \brief 9A44, TOM3 Channel 9 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH9_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109A44u)

/** \brief 9A48, TOM3 Channel 9 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH9_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109A48u)

/** \brief 9A4C, TOM3 Channel 9 CCU0 Compare Register */
#define GTM_TOM3_CH9_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109A4Cu)

/** \brief 9A50, TOM3 Channel 9 CCU1 Compare Register */
#define GTM_TOM3_CH9_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109A50u)

/** \brief 9A54, TOM3 Channel 9 CCU0 Counter Register */
#define GTM_TOM3_CH9_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109A54u)

/** \brief 9A58, TOM3 Channel 9 Status Register */
#define GTM_TOM3_CH9_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109A58u)

/** \brief 9A5C, TOM3 Channel 9 Interrupt Notification Register */
#define GTM_TOM3_CH9_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109A5Cu)

/** \brief 9A60, TOM3 Channel 9 Interrupt Enable Register */
#define GTM_TOM3_CH9_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109A60u)

/** \brief 9A64, TOM3 Channel 9 Force Interrupt Register */
#define GTM_TOM3_CH9_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109A64u)

/** \brief 9A68, TOM3 Channel 9 Interrupt Mode Register */
#define GTM_TOM3_CH9_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109A68u)

/** \brief 9A70, TOM3 TGC1 Enable/Disable Control Register */
#define GTM_TOM3_TGC1_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF0109A70u)

/** \brief 9A74, TOM3 TGC1 Enable/Disable Status Register */
#define GTM_TOM3_TGC1_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF0109A74u)

/** \brief 9A78, TOM3 TGC1 Output Enable Control Register */
#define GTM_TOM3_TGC1_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF0109A78u)

/** \brief 9A7C, TOM3 TGC1 Output Enable Status Register */
#define GTM_TOM3_TGC1_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF0109A7Cu)

/** \brief 9A80, TOM3 Channel 10 Control Register */
#define GTM_TOM3_CH10_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109A80u)

/** \brief 9A84, TOM3 Channel 10 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH10_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109A84u)

/** \brief 9A88, TOM3 Channel 10 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH10_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109A88u)

/** \brief 9A8C, TOM3 Channel 10 CCU0 Compare Register */
#define GTM_TOM3_CH10_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109A8Cu)

/** \brief 9A90, TOM3 Channel 10 CCU1 Compare Register */
#define GTM_TOM3_CH10_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109A90u)

/** \brief 9A94, TOM3 Channel 10 CCU0 Counter Register */
#define GTM_TOM3_CH10_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109A94u)

/** \brief 9A98, TOM3 Channel 10 Status Register */
#define GTM_TOM3_CH10_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109A98u)

/** \brief 9A9C, TOM3 Channel 10 Interrupt Notification Register */
#define GTM_TOM3_CH10_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109A9Cu)

/** \brief 9AA0, TOM3 Channel 10 Interrupt Enable Register */
#define GTM_TOM3_CH10_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109AA0u)

/** \brief 9AA4, TOM3 Channel 10 Force Interrupt Register */
#define GTM_TOM3_CH10_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109AA4u)

/** \brief 9AA8, TOM3 Channel 10 Interrupt Mode Register */
#define GTM_TOM3_CH10_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109AA8u)

/** \brief 9AC0, TOM3 Channel 11 Control Register */
#define GTM_TOM3_CH11_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109AC0u)

/** \brief 9AC4, TOM3 Channel 11 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH11_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109AC4u)

/** \brief 9AC8, TOM3 Channel 11 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH11_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109AC8u)

/** \brief 9ACC, TOM3 Channel 11 CCU0 Compare Register */
#define GTM_TOM3_CH11_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109ACCu)

/** \brief 9AD0, TOM3 Channel 11 CCU1 Compare Register */
#define GTM_TOM3_CH11_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109AD0u)

/** \brief 9AD4, TOM3 Channel 11 CCU0 Counter Register */
#define GTM_TOM3_CH11_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109AD4u)

/** \brief 9AD8, TOM3 Channel 11 Status Register */
#define GTM_TOM3_CH11_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109AD8u)

/** \brief 9ADC, TOM3 Channel 11 Interrupt Notification Register */
#define GTM_TOM3_CH11_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109ADCu)

/** \brief 9AE0, TOM3 Channel 11 Interrupt Enable Register */
#define GTM_TOM3_CH11_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109AE0u)

