HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 9AE4, TOM3 Channel 11 Force Interrupt Register */
#define GTM_TOM3_CH11_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109AE4u)

/** \brief 9AE8, TOM3 Channel 11 Interrupt Mode Register */
#define GTM_TOM3_CH11_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109AE8u)

/** \brief 9B00, TOM3 Channel 12 Control Register */
#define GTM_TOM3_CH12_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109B00u)

/** \brief 9B04, TOM3 Channel 12 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH12_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109B04u)

/** \brief 9B08, TOM3 Channel 12 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH12_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109B08u)

/** \brief 9B0C, TOM3 Channel 12 CCU0 Compare Register */
#define GTM_TOM3_CH12_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109B0Cu)

/** \brief 9B10, TOM3 Channel 12 CCU1 Compare Register */
#define GTM_TOM3_CH12_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109B10u)

/** \brief 9B14, TOM3 Channel 12 CCU0 Counter Register */
#define GTM_TOM3_CH12_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109B14u)

/** \brief 9B18, TOM3 Channel 12 Status Register */
#define GTM_TOM3_CH12_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109B18u)

/** \brief 9B1C, TOM3 Channel 12 Interrupt Notification Register */
#define GTM_TOM3_CH12_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109B1Cu)

/** \brief 9B20, TOM3 Channel 12 Interrupt Enable Register */
#define GTM_TOM3_CH12_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109B20u)

/** \brief 9B24, TOM3 Channel 12 Force Interrupt Register */
#define GTM_TOM3_CH12_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109B24u)

/** \brief 9B28, TOM3 Channel 12 Interrupt Mode Register */
#define GTM_TOM3_CH12_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109B28u)

/** \brief 9B40, TOM3 Channel 13 Control Register */
#define GTM_TOM3_CH13_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109B40u)

/** \brief 9B44, TOM3 Channel 13 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH13_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109B44u)

/** \brief 9B48, TOM3 Channel 13 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH13_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109B48u)

/** \brief 9B4C, TOM3 Channel 13 CCU0 Compare Register */
#define GTM_TOM3_CH13_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109B4Cu)

/** \brief 9B50, TOM3 Channel 13 CCU1 Compare Register */
#define GTM_TOM3_CH13_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109B50u)

/** \brief 9B54, TOM3 Channel 13 CCU0 Counter Register */
#define GTM_TOM3_CH13_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109B54u)

/** \brief 9B58, TOM3 Channel 13 Status Register */
#define GTM_TOM3_CH13_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109B58u)

/** \brief 9B5C, TOM3 Channel 13 Interrupt Notification Register */
#define GTM_TOM3_CH13_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109B5Cu)

/** \brief 9B60, TOM3 Channel 13 Interrupt Enable Register */
#define GTM_TOM3_CH13_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109B60u)

/** \brief 9B64, TOM3 Channel 13 Force Interrupt Register */
#define GTM_TOM3_CH13_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109B64u)

/** \brief 9B68, TOM3 Channel 13 Interrupt Mode Register */
#define GTM_TOM3_CH13_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109B68u)

/** \brief 9B80, TOM3 Channel 14 Control Register */
#define GTM_TOM3_CH14_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109B80u)

/** \brief 9B84, TOM3 Channel 14 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH14_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109B84u)

/** \brief 9B88, TOM3 Channel 14 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH14_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109B88u)

/** \brief 9B8C, TOM3 Channel 14 CCU0 Compare Register */
#define GTM_TOM3_CH14_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109B8Cu)

/** \brief 9B90, TOM3 Channel 14 CCU1 Compare Register */
#define GTM_TOM3_CH14_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109B90u)

/** \brief 9B94, TOM3 Channel 14 CCU0 Counter Register */
#define GTM_TOM3_CH14_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109B94u)

/** \brief 9B98, TOM3 Channel 14 Status Register */
#define GTM_TOM3_CH14_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109B98u)

/** \brief 9B9C, TOM3 Channel 14 Interrupt Notification Register */
#define GTM_TOM3_CH14_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109B9Cu)

/** \brief 9BA0, TOM3 Channel 14 Interrupt Enable Register */
#define GTM_TOM3_CH14_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109BA0u)

/** \brief 9BA4, TOM3 Channel 14 Force Interrupt Register */
#define GTM_TOM3_CH14_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109BA4u)

/** \brief 9BA8, TOM3 Channel 14 Interrupt Mode Register */
#define GTM_TOM3_CH14_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109BA8u)

/** \brief 9BC0, TOM3 Channel 15 Control Register */
#define GTM_TOM3_CH15_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109BC0u)

/** \brief 9BC4, TOM3 Channel 15 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH15_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109BC4u)

/** \brief 9BC8, TOM3 Channel 15 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH15_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109BC8u)

