HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief A164, TOM4 Channel 5 Force Interrupt Register */
#define GTM_TOM4_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A164u)

/** \brief A168, TOM4 Channel 5 Interrupt Mode Register */
#define GTM_TOM4_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A168u)

/** \brief A180, TOM4 Channel 6 Control Register */
#define GTM_TOM4_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A180u)

/** \brief A184, TOM4 Channel 6 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A184u)

/** \brief A188, TOM4 Channel 6 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A188u)

/** \brief A18C, TOM4 Channel 6 CCU0 Compare Register */
#define GTM_TOM4_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A18Cu)

/** \brief A190, TOM4 Channel 6 CCU1 Compare Register */
#define GTM_TOM4_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A190u)

/** \brief A194, TOM4 Channel 6 CCU0 Counter Register */
#define GTM_TOM4_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A194u)

/** \brief A198, TOM4 Channel 6 Status Register */
#define GTM_TOM4_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A198u)

/** \brief A19C, TOM4 Channel 6 Interrupt Notification Register */
#define GTM_TOM4_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A19Cu)

/** \brief A1A0, TOM4 Channel 6 Interrupt Enable Register */
#define GTM_TOM4_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A1A0u)

/** \brief A1A4, TOM4 Channel 6 Force Interrupt Register */
#define GTM_TOM4_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A1A4u)

/** \brief A1A8, TOM4 Channel 6 Interrupt Mode Register */
#define GTM_TOM4_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A1A8u)

/** \brief A1C0, TOM4 Channel 7 Control Register */
#define GTM_TOM4_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A1C0u)

/** \brief A1C4, TOM4 Channel 7 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A1C4u)

/** \brief A1C8, TOM4 Channel 7 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A1C8u)

/** \brief A1CC, TOM4 Channel 7 CCU0 Compare Register */
#define GTM_TOM4_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A1CCu)

/** \brief A1D0, TOM4 Channel 7 CCU1 Compare Register */
#define GTM_TOM4_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A1D0u)

/** \brief A1D4, TOM4 Channel 7 CCU0 Counter Register */
#define GTM_TOM4_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A1D4u)

/** \brief A1D8, TOM4 Channel 7 Status Register */
#define GTM_TOM4_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A1D8u)

/** \brief A1DC, TOM4 Channel 7 Interrupt Notification Register */
#define GTM_TOM4_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A1DCu)

/** \brief A1E0, TOM4 Channel 7 Interrupt Enable Register */
#define GTM_TOM4_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A1E0u)

/** \brief A1E4, TOM4 Channel 7 Force Interrupt Register */
#define GTM_TOM4_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A1E4u)

/** \brief A1E8, TOM4 Channel 7 Interrupt Mode Register */
#define GTM_TOM4_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A1E8u)

/** \brief A200, TOM4 Channel 8 Control Register */
#define GTM_TOM4_CH8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A200u)

/** \brief A204, TOM4 Channel 8 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH8_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A204u)

/** \brief A208, TOM4 Channel 8 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH8_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A208u)

/** \brief A20C, TOM4 Channel 8 CCU0 Compare Register */
#define GTM_TOM4_CH8_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A20Cu)

/** \brief A210, TOM4 Channel 8 CCU1 Compare Register */
#define GTM_TOM4_CH8_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A210u)

/** \brief A214, TOM4 Channel 8 CCU0 Counter Register */
#define GTM_TOM4_CH8_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A214u)

/** \brief A218, TOM4 Channel 8 Status Register */
#define GTM_TOM4_CH8_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A218u)

/** \brief A21C, TOM4 Channel 8 Interrupt Notification Register */
#define GTM_TOM4_CH8_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A21Cu)

/** \brief A220, TOM4 Channel 8 Interrupt Enable Register */
#define GTM_TOM4_CH8_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A220u)

/** \brief A224, TOM4 Channel 8 Force Interrupt Register */
#define GTM_TOM4_CH8_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A224u)

/** \brief A228, TOM4 Channel 8 Interrupt Mode Register */
#define GTM_TOM4_CH8_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A228u)

/** \brief A230, TOM4 TGC1 Global Control Register */
#define GTM_TOM4_TGC1_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF010A230u)

/** \brief A234, TOM4 TGC1 Action Time Base Register */
#define GTM_TOM4_TGC1_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF010A234u)

/** \brief A238, TOM4 TGC1 Force Update Control Register */
#define GTM_TOM4_TGC1_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF010A238u)

