HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief A23C, TOM4 TGC1 Internal Trigger Control Register */
#define GTM_TOM4_TGC1_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF010A23Cu)

/** \brief A240, TOM4 Channel 9 Control Register */
#define GTM_TOM4_CH9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A240u)

/** \brief A244, TOM4 Channel 9 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH9_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A244u)

/** \brief A248, TOM4 Channel 9 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH9_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A248u)

/** \brief A24C, TOM4 Channel 9 CCU0 Compare Register */
#define GTM_TOM4_CH9_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A24Cu)

/** \brief A250, TOM4 Channel 9 CCU1 Compare Register */
#define GTM_TOM4_CH9_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A250u)

/** \brief A254, TOM4 Channel 9 CCU0 Counter Register */
#define GTM_TOM4_CH9_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A254u)

/** \brief A258, TOM4 Channel 9 Status Register */
#define GTM_TOM4_CH9_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A258u)

/** \brief A25C, TOM4 Channel 9 Interrupt Notification Register */
#define GTM_TOM4_CH9_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A25Cu)

/** \brief A260, TOM4 Channel 9 Interrupt Enable Register */
#define GTM_TOM4_CH9_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A260u)

/** \brief A264, TOM4 Channel 9 Force Interrupt Register */
#define GTM_TOM4_CH9_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A264u)

/** \brief A268, TOM4 Channel 9 Interrupt Mode Register */
#define GTM_TOM4_CH9_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A268u)

/** \brief A270, TOM4 TGC1 Enable/Disable Control Register */
#define GTM_TOM4_TGC1_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF010A270u)

/** \brief A274, TOM4 TGC1 Enable/Disable Status Register */
#define GTM_TOM4_TGC1_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF010A274u)

/** \brief A278, TOM4 TGC1 Output Enable Control Register */
#define GTM_TOM4_TGC1_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF010A278u)

/** \brief A27C, TOM4 TGC1 Output Enable Status Register */
#define GTM_TOM4_TGC1_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF010A27Cu)

/** \brief A280, TOM4 Channel 10 Control Register */
#define GTM_TOM4_CH10_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A280u)

/** \brief A284, TOM4 Channel 10 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH10_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A284u)

/** \brief A288, TOM4 Channel 10 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH10_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A288u)

/** \brief A28C, TOM4 Channel 10 CCU0 Compare Register */
#define GTM_TOM4_CH10_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A28Cu)

/** \brief A290, TOM4 Channel 10 CCU1 Compare Register */
#define GTM_TOM4_CH10_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A290u)

/** \brief A294, TOM4 Channel 10 CCU0 Counter Register */
#define GTM_TOM4_CH10_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A294u)

/** \brief A298, TOM4 Channel 10 Status Register */
#define GTM_TOM4_CH10_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A298u)

/** \brief A29C, TOM4 Channel 10 Interrupt Notification Register */
#define GTM_TOM4_CH10_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A29Cu)

/** \brief A2A0, TOM4 Channel 10 Interrupt Enable Register */
#define GTM_TOM4_CH10_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A2A0u)

/** \brief A2A4, TOM4 Channel 10 Force Interrupt Register */
#define GTM_TOM4_CH10_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A2A4u)

/** \brief A2A8, TOM4 Channel 10 Interrupt Mode Register */
#define GTM_TOM4_CH10_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A2A8u)

/** \brief A2C0, TOM4 Channel 11 Control Register */
#define GTM_TOM4_CH11_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A2C0u)

/** \brief A2C4, TOM4 Channel 11 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH11_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A2C4u)

/** \brief A2C8, TOM4 Channel 11 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH11_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A2C8u)

/** \brief A2CC, TOM4 Channel 11 CCU0 Compare Register */
#define GTM_TOM4_CH11_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A2CCu)

/** \brief A2D0, TOM4 Channel 11 CCU1 Compare Register */
#define GTM_TOM4_CH11_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A2D0u)

/** \brief A2D4, TOM4 Channel 11 CCU0 Counter Register */
#define GTM_TOM4_CH11_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A2D4u)

/** \brief A2D8, TOM4 Channel 11 Status Register */
#define GTM_TOM4_CH11_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A2D8u)

/** \brief A2DC, TOM4 Channel 11 Interrupt Notification Register */
#define GTM_TOM4_CH11_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A2DCu)

/** \brief A2E0, TOM4 Channel 11 Interrupt Enable Register */
#define GTM_TOM4_CH11_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A2E0u)

/** \brief A2E4, TOM4 Channel 11 Force Interrupt Register */
#define GTM_TOM4_CH11_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A2E4u)

/** \brief A2E8, TOM4 Channel 11 Interrupt Mode Register */
#define GTM_TOM4_CH11_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A2E8u)

