HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief A300, TOM4 Channel 12 Control Register */
#define GTM_TOM4_CH12_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A300u)

/** \brief A304, TOM4 Channel 12 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH12_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A304u)

/** \brief A308, TOM4 Channel 12 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH12_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A308u)

/** \brief A30C, TOM4 Channel 12 CCU0 Compare Register */
#define GTM_TOM4_CH12_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A30Cu)

/** \brief A310, TOM4 Channel 12 CCU1 Compare Register */
#define GTM_TOM4_CH12_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A310u)

/** \brief A314, TOM4 Channel 12 CCU0 Counter Register */
#define GTM_TOM4_CH12_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A314u)

/** \brief A318, TOM4 Channel 12 Status Register */
#define GTM_TOM4_CH12_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A318u)

/** \brief A31C, TOM4 Channel 12 Interrupt Notification Register */
#define GTM_TOM4_CH12_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A31Cu)

/** \brief A320, TOM4 Channel 12 Interrupt Enable Register */
#define GTM_TOM4_CH12_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A320u)

/** \brief A324, TOM4 Channel 12 Force Interrupt Register */
#define GTM_TOM4_CH12_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A324u)

/** \brief A328, TOM4 Channel 12 Interrupt Mode Register */
#define GTM_TOM4_CH12_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A328u)

/** \brief A340, TOM4 Channel 13 Control Register */
#define GTM_TOM4_CH13_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A340u)

/** \brief A344, TOM4 Channel 13 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH13_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A344u)

/** \brief A348, TOM4 Channel 13 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH13_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A348u)

/** \brief A34C, TOM4 Channel 13 CCU0 Compare Register */
#define GTM_TOM4_CH13_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A34Cu)

/** \brief A350, TOM4 Channel 13 CCU1 Compare Register */
#define GTM_TOM4_CH13_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A350u)

/** \brief A354, TOM4 Channel 13 CCU0 Counter Register */
#define GTM_TOM4_CH13_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A354u)

/** \brief A358, TOM4 Channel 13 Status Register */
#define GTM_TOM4_CH13_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A358u)

/** \brief A35C, TOM4 Channel 13 Interrupt Notification Register */
#define GTM_TOM4_CH13_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A35Cu)

/** \brief A360, TOM4 Channel 13 Interrupt Enable Register */
#define GTM_TOM4_CH13_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A360u)

/** \brief A364, TOM4 Channel 13 Force Interrupt Register */
#define GTM_TOM4_CH13_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A364u)

/** \brief A368, TOM4 Channel 13 Interrupt Mode Register */
#define GTM_TOM4_CH13_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A368u)

/** \brief A380, TOM4 Channel 14 Control Register */
#define GTM_TOM4_CH14_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A380u)

/** \brief A384, TOM4 Channel 14 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH14_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A384u)

/** \brief A388, TOM4 Channel 14 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH14_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A388u)

/** \brief A38C, TOM4 Channel 14 CCU0 Compare Register */
#define GTM_TOM4_CH14_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A38Cu)

/** \brief A390, TOM4 Channel 14 CCU1 Compare Register */
#define GTM_TOM4_CH14_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A390u)

/** \brief A394, TOM4 Channel 14 CCU0 Counter Register */
#define GTM_TOM4_CH14_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A394u)

/** \brief A398, TOM4 Channel 14 Status Register */
#define GTM_TOM4_CH14_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A398u)

/** \brief A39C, TOM4 Channel 14 Interrupt Notification Register */
#define GTM_TOM4_CH14_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A39Cu)

/** \brief A3A0, TOM4 Channel 14 Interrupt Enable Register */
#define GTM_TOM4_CH14_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A3A0u)

/** \brief A3A4, TOM4 Channel 14 Force Interrupt Register */
#define GTM_TOM4_CH14_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A3A4u)

/** \brief A3A8, TOM4 Channel 14 Interrupt Mode Register */
#define GTM_TOM4_CH14_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A3A8u)

/** \brief A3C0, TOM4 Channel 15 Control Register */
#define GTM_TOM4_CH15_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A3C0u)

/** \brief A3C4, TOM4 Channel 15 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH15_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A3C4u)

/** \brief A3C8, TOM4 Channel 15 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH15_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A3C8u)

/** \brief A3CC, TOM4 Channel 15 CCU0 Compare Register */
#define GTM_TOM4_CH15_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A3CCu)

/** \brief A3D0, TOM4 Channel 15 CCU1 Compare Register */
#define GTM_TOM4_CH15_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A3D0u)

/** \brief A3D4, TOM4 Channel 15 CCU0 Counter Register */
#define GTM_TOM4_CH15_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A3D4u)

/** \brief A3D8, TOM4 Channel 15 Status Register */
#define GTM_TOM4_CH15_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A3D8u)

/** \brief A3DC, TOM4 Channel 15 Interrupt Notification Register */
#define GTM_TOM4_CH15_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A3DCu)

/** \brief A3E0, TOM4 Channel 15 Interrupt Enable Register */
#define GTM_TOM4_CH15_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A3E0u)

/** \brief A3E4, TOM4 Channel 15 Force Interrupt Register */
#define GTM_TOM4_CH15_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A3E4u)

/** \brief A3E8, TOM4 Channel 15 Interrupt Mode Register */
#define GTM_TOM4_CH15_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A3E8u)

/** \brief 18000, F2A0 Stream 0 Read Address Register */
#define GTM_PSM0_F2A_RD_CH0_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF0118000u)
/** Alias (User Manual Name) for GTM_PSM0_F2A_RD_CH0_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM0_F2A_RD_CH0_ARU_RD_FIFO.
*/
#define GTM_F2A0_CH0_ARU_RD_FIFO (GTM_PSM0_F2A_RD_CH0_ARU_RD_FIFO)

