HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 1C024, F2A1 Stream 1 Configuration Register */
#define GTM_PSM1_F2A_STR_CH1_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF011C024u)
/** Alias (User Manual Name) for GTM_PSM1_F2A_STR_CH1_STR_CFG.
* To use register names with standard convension, please use GTM_PSM1_F2A_STR_CH1_STR_CFG.
*/
#define GTM_F2A1_CH1_STR_CFG (GTM_PSM1_F2A_STR_CH1_STR_CFG)

/** \brief 1C028, F2A1 Stream 2 Configuration Register */
#define GTM_PSM1_F2A_STR_CH2_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF011C028u)
/** Alias (User Manual Name) for GTM_PSM1_F2A_STR_CH2_STR_CFG.
* To use register names with standard convension, please use GTM_PSM1_F2A_STR_CH2_STR_CFG.
*/
#define GTM_F2A1_CH2_STR_CFG (GTM_PSM1_F2A_STR_CH2_STR_CFG)

/** \brief 1C02C, F2A1 Stream 3 Configuration Register */
#define GTM_PSM1_F2A_STR_CH3_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF011C02Cu)
/** Alias (User Manual Name) for GTM_PSM1_F2A_STR_CH3_STR_CFG.
* To use register names with standard convension, please use GTM_PSM1_F2A_STR_CH3_STR_CFG.
*/
#define GTM_F2A1_CH3_STR_CFG (GTM_PSM1_F2A_STR_CH3_STR_CFG)

/** \brief 1C030, F2A1 Stream 4 Configuration Register */
#define GTM_PSM1_F2A_STR_CH4_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF011C030u)
/** Alias (User Manual Name) for GTM_PSM1_F2A_STR_CH4_STR_CFG.
* To use register names with standard convension, please use GTM_PSM1_F2A_STR_CH4_STR_CFG.
*/
#define GTM_F2A1_CH4_STR_CFG (GTM_PSM1_F2A_STR_CH4_STR_CFG)

/** \brief 1C034, F2A1 Stream 5 Configuration Register */
#define GTM_PSM1_F2A_STR_CH5_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF011C034u)
/** Alias (User Manual Name) for GTM_PSM1_F2A_STR_CH5_STR_CFG.
* To use register names with standard convension, please use GTM_PSM1_F2A_STR_CH5_STR_CFG.
*/
#define GTM_F2A1_CH5_STR_CFG (GTM_PSM1_F2A_STR_CH5_STR_CFG)

/** \brief 1C038, F2A1 Stream 6 Configuration Register */
#define GTM_PSM1_F2A_STR_CH6_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF011C038u)
/** Alias (User Manual Name) for GTM_PSM1_F2A_STR_CH6_STR_CFG.
* To use register names with standard convension, please use GTM_PSM1_F2A_STR_CH6_STR_CFG.
*/
#define GTM_F2A1_CH6_STR_CFG (GTM_PSM1_F2A_STR_CH6_STR_CFG)

/** \brief 1C03C, F2A1 Stream 7 Configuration Register */
#define GTM_PSM1_F2A_STR_CH7_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF011C03Cu)
/** Alias (User Manual Name) for GTM_PSM1_F2A_STR_CH7_STR_CFG.
* To use register names with standard convension, please use GTM_PSM1_F2A_STR_CH7_STR_CFG.
*/
#define GTM_F2A1_CH7_STR_CFG (GTM_PSM1_F2A_STR_CH7_STR_CFG)

/** \brief 1C040, F2A1 Stream Activation Register */
#define GTM_PSM1_F2A_ENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_ENABLE*)0xF011C040u)
/** Alias (User Manual Name) for GTM_PSM1_F2A_ENABLE.
* To use register names with standard convension, please use GTM_PSM1_F2A_ENABLE.
*/
#define GTM_F2A1_ENABLE (GTM_PSM1_F2A_ENABLE)

/** \brief 1C044, F2A1 Stream Control Register */
#define GTM_PSM1_F2A_F2A_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_F2A_CTRL*)0xF011C044u)
/** Alias (User Manual Name) for GTM_PSM1_F2A_F2A_CTRL.
* To use register names with standard convension, please use GTM_PSM1_F2A_F2A_CTRL.
*/
#define GTM_F2A1_CTRL (GTM_PSM1_F2A_F2A_CTRL)

/** \brief 1C080, AFD 1 FIFO 0 Buffer Access Register */
#define GTM_PSM1_AFD_CH0_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C080u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH0_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH0_BUF_ACC.
*/
#define GTM_AFD1_CH0_BUF_ACC (GTM_PSM1_AFD_CH0_BUF_ACC)

/** \brief 1C090, AFD 1 FIFO 1 Buffer Access Register */
#define GTM_PSM1_AFD_CH1_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C090u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH1_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH1_BUF_ACC.
*/
#define GTM_AFD1_CH1_BUF_ACC (GTM_PSM1_AFD_CH1_BUF_ACC)

/** \brief 1C0A0, AFD 1 FIFO 2 Buffer Access Register */
#define GTM_PSM1_AFD_CH2_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C0A0u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH2_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH2_BUF_ACC.
*/
#define GTM_AFD1_CH2_BUF_ACC (GTM_PSM1_AFD_CH2_BUF_ACC)

/** \brief 1C0B0, AFD 1 FIFO 3 Buffer Access Register */
#define GTM_PSM1_AFD_CH3_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C0B0u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH3_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH3_BUF_ACC.
*/
#define GTM_AFD1_CH3_BUF_ACC (GTM_PSM1_AFD_CH3_BUF_ACC)

/** \brief 1C0C0, AFD 1 FIFO 4 Buffer Access Register */
#define GTM_PSM1_AFD_CH4_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C0C0u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH4_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH4_BUF_ACC.
*/
#define GTM_AFD1_CH4_BUF_ACC (GTM_PSM1_AFD_CH4_BUF_ACC)

/** \brief 1C0D0, AFD 1 FIFO 5 Buffer Access Register */
#define GTM_PSM1_AFD_CH5_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C0D0u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH5_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH5_BUF_ACC.
*/
#define GTM_AFD1_CH5_BUF_ACC (GTM_PSM1_AFD_CH5_BUF_ACC)

/** \brief 1C0E0, AFD 1 FIFO 6 Buffer Access Register */
#define GTM_PSM1_AFD_CH6_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C0E0u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH6_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH6_BUF_ACC.
*/
#define GTM_AFD1_CH6_BUF_ACC (GTM_PSM1_AFD_CH6_BUF_ACC)

/** \brief 1C0F0, AFD 1 FIFO 7 Buffer Access Register */
#define GTM_PSM1_AFD_CH7_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF011C0F0u)
/** Alias (User Manual Name) for GTM_PSM1_AFD_CH7_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM1_AFD_CH7_BUF_ACC.
*/
#define GTM_AFD1_CH7_BUF_ACC (GTM_PSM1_AFD_CH7_BUF_ACC)

/** \brief 1C400, FIFO1 Channel 0 Control Register */
#define GTM_PSM1_FIFO_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C400u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_CTRL.
*/
#define GTM_FIFO1_CH0_CTRL (GTM_PSM1_FIFO_CH0_CTRL)

/** \brief 1C404, FIFO1 Channel 0 End Address Register */
#define GTM_PSM1_FIFO_CH0_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C404u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_END_ADDR.
*/
#define GTM_FIFO1_CH0_END_ADDR (GTM_PSM1_FIFO_CH0_END_ADDR)

/** \brief 1C408, FIFO1 Channel 0 Start Address Register */
#define GTM_PSM1_FIFO_CH0_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C408u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_START_ADDR.
*/
#define GTM_FIFO1_CH0_START_ADDR (GTM_PSM1_FIFO_CH0_START_ADDR)

/** \brief 1C40C, FIFO1 Channel 0 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH0_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C40Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_UPPER_WM.
*/
#define GTM_FIFO1_CH0_UPPER_WM (GTM_PSM1_FIFO_CH0_UPPER_WM)

