HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief 1C5C8, FIFO1 Channel 7 Start Address Register */
#define GTM_PSM1_FIFO_CH7_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C5C8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_START_ADDR.
*/
#define GTM_FIFO1_CH7_START_ADDR (GTM_PSM1_FIFO_CH7_START_ADDR)

/** \brief 1C5CC, FIFO1 Channel 7 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH7_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C5CCu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_UPPER_WM.
*/
#define GTM_FIFO1_CH7_UPPER_WM (GTM_PSM1_FIFO_CH7_UPPER_WM)

/** \brief 1C5D0, FIFO1 Channel 7 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH7_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C5D0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_LOWER_WM.
*/
#define GTM_FIFO1_CH7_LOWER_WM (GTM_PSM1_FIFO_CH7_LOWER_WM)

/** \brief 1C5D4, FIFO1 Channel 7 Status Register */
#define GTM_PSM1_FIFO_CH7_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C5D4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_STATUS.
*/
#define GTM_FIFO1_CH7_STATUS (GTM_PSM1_FIFO_CH7_STATUS)

/** \brief 1C5D8, FIFO1 Channel 7 Fill Level Register */
#define GTM_PSM1_FIFO_CH7_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C5D8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_FILL_LEVEL.
*/
#define GTM_FIFO1_CH7_FILL_LEVEL (GTM_PSM1_FIFO_CH7_FILL_LEVEL)

/** \brief 1C5DC, FIFO1 Channel 7 Write Pointer Register */
#define GTM_PSM1_FIFO_CH7_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C5DCu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_WR_PTR.
*/
#define GTM_FIFO1_CH7_WR_PTR (GTM_PSM1_FIFO_CH7_WR_PTR)

/** \brief 1C5E0, FIFO1 Channel 7 Read Pointer Register */
#define GTM_PSM1_FIFO_CH7_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C5E0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_RD_PTR.
*/
#define GTM_FIFO1_CH7_RD_PTR (GTM_PSM1_FIFO_CH7_RD_PTR)

/** \brief 1C5E4, FIFO1 Channel 7 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C5E4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH7_IRQ_NOTIFY (GTM_PSM1_FIFO_CH7_IRQ_NOTIFY)

/** \brief 1C5E8, FIFO1 Channel 7 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C5E8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_EN.
*/
#define GTM_FIFO1_CH7_IRQ_EN (GTM_PSM1_FIFO_CH7_IRQ_EN)

/** \brief 1C5EC, FIFO1 Channel 7 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C5ECu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH7_IRQ_FORCINT (GTM_PSM1_FIFO_CH7_IRQ_FORCINT)

/** \brief 1C5F0, FIFO1 Channel 7 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C5F0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_MODE.
*/
#define GTM_FIFO1_CH7_IRQ_MODE (GTM_PSM1_FIFO_CH7_IRQ_MODE)

/** \brief 1C5F4, FIFO1 Channel 7 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C5F4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_EIRQ_EN.
*/
#define GTM_FIFO1_CH7_EIRQ_EN (GTM_PSM1_FIFO_CH7_EIRQ_EN)

/** \brief 28000, DPLL Control Register 0 */
#define GTM_DPLL_CTRL_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_CTRL_0*)0xF0128000u)

/** \brief 28004, DPLL Control Register 1 */
#define GTM_DPLL_CTRL_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_CTRL_1*)0xF0128004u)

/** \brief 28008, DPLL Control Register 2 */
#define GTM_DPLL_CTRL_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_CTRL_2*)0xF0128008u)

/** \brief 2800C, DPLL Control Register 3 */
#define GTM_DPLL_CTRL_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_CTRL_3*)0xF012800Cu)

/** \brief 28010, DPLL Control Register 4 */
#define GTM_DPLL_CTRL_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_CTRL_4*)0xF0128010u)

/** \brief 28014, DPLL Control Register 5 */
#define GTM_DPLL_CTRL_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_CTRL_5*)0xF0128014u)

/** \brief 28018, DPLL ACTION Status Register with Connected Shadow Register */
#define GTM_DPLL_ACT_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_ACT_STA*)0xF0128018u)

/** \brief 2801C, DPLL Offset and Switch Old/New Address Register */
#define GTM_DPLL_OSW /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_OSW*)0xF012801Cu)

/** \brief 28020, DPLL Address Offset Register of RAM 2 Regions */
#define GTM_DPLL_AOSV_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DPLL_AOSV_2*)0xF0128020u)

