HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief E2634, CCM3 Address Range Protector 6 Protection Register */
#define GTM_CCM3_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2634u)

/** \brief E2638, CCM3 Address Range Protector 7 Control Register */
#define GTM_CCM3_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2638u)

/** \brief E263C, CCM3 Address Range Protector 7 Protection Register */
#define GTM_CCM3_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E263Cu)

/** \brief E2640, CCM3 Address Range Protector 8 Control Register */
#define GTM_CCM3_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2640u)

/** \brief E2644, CCM3 Address Range Protector 8 Protection Register */
#define GTM_CCM3_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2644u)

/** \brief E2648, CCM3 Address Range Protector 9 Control Register */
#define GTM_CCM3_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2648u)

/** \brief E264C, CCM3 Address Range Protector 9 Protection Register */
#define GTM_CCM3_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E264Cu)

/** \brief E27D8, CCM3 MCS Bus Master Status Register */
#define GTM_CCM3_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E27D8u)

/** \brief E27DC, CCM3 Hardware Configuration Register */
#define GTM_CCM3_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E27DCu)

/** \brief E27E0, CCM3 TIM Module AUX_IN Source Selection Register */
#define GTM_CCM3_TIM_AUX_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC*)0xF01E27E0u)

/** \brief E27E4, CCM3 External Capture Trigger Enable Register */
#define GTM_CCM3_EXT_CAP_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN*)0xF01E27E4u)

/** \brief E27E8, CCM3 TOM Output Level Register */
#define GTM_CCM3_TOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT*)0xF01E27E8u)

/** \brief E27EC, CCM3 ATOM Output Level Register */
#define GTM_CCM3_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E27ECu)

/** \brief E27F0, CCM3 CMU Clock Configuration Register */
#define GTM_CCM3_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E27F0u)

/** \brief E27F4, CCM3 CMU Fixed Clock Configuration Register */
#define GTM_CCM3_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E27F4u)

/** \brief E27F8, CCM3 Configuration Register */
#define GTM_CCM3_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E27F8u)

/** \brief E27FC, CCM3 Protection Register */
#define GTM_CCM3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E27FCu)

/** \brief E2800, CCM4 Address Range Protector 0 Control Register */
#define GTM_CCM4_ARP0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2800u)

/** \brief E2804, CCM4 Address Range Protector 0 Protection Register */
#define GTM_CCM4_ARP0_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2804u)

/** \brief E2808, CCM4 Address Range Protector 1 Control Register */
#define GTM_CCM4_ARP1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2808u)

/** \brief E280C, CCM4 Address Range Protector 1 Protection Register */
#define GTM_CCM4_ARP1_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E280Cu)

/** \brief E2810, CCM4 Address Range Protector 2 Control Register */
#define GTM_CCM4_ARP2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2810u)

/** \brief E2814, CCM4 Address Range Protector 2 Protection Register */
#define GTM_CCM4_ARP2_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2814u)

/** \brief E2818, CCM4 Address Range Protector 3 Control Register */
#define GTM_CCM4_ARP3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2818u)

/** \brief E281C, CCM4 Address Range Protector 3 Protection Register */
#define GTM_CCM4_ARP3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E281Cu)

/** \brief E2820, CCM4 Address Range Protector 4 Control Register */
#define GTM_CCM4_ARP4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2820u)

/** \brief E2824, CCM4 Address Range Protector 4 Protection Register */
#define GTM_CCM4_ARP4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2824u)

/** \brief E2828, CCM4 Address Range Protector 5 Control Register */
#define GTM_CCM4_ARP5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2828u)

/** \brief E282C, CCM4 Address Range Protector 5 Protection Register */
#define GTM_CCM4_ARP5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E282Cu)

/** \brief E2830, CCM4 Address Range Protector 6 Control Register */
#define GTM_CCM4_ARP6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2830u)

/** \brief E2834, CCM4 Address Range Protector 6 Protection Register */
#define GTM_CCM4_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2834u)

/** \brief E2838, CCM4 Address Range Protector 7 Control Register */
#define GTM_CCM4_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2838u)

/** \brief E283C, CCM4 Address Range Protector 7 Protection Register */
#define GTM_CCM4_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E283Cu)

/** \brief E2840, CCM4 Address Range Protector 8 Control Register */
#define GTM_CCM4_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2840u)

/** \brief E2844, CCM4 Address Range Protector 8 Protection Register */
#define GTM_CCM4_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2844u)

/** \brief E2848, CCM4 Address Range Protector 9 Control Register */
#define GTM_CCM4_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2848u)

/** \brief E284C, CCM4 Address Range Protector 9 Protection Register */
#define GTM_CCM4_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E284Cu)

/** \brief E29D8, CCM4 MCS Bus Master Status Register */
#define GTM_CCM4_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E29D8u)

/** \brief E29DC, CCM4 Hardware Configuration Register */
#define GTM_CCM4_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E29DCu)

/** \brief E29E0, CCM4 TIM Module AUX_IN Source Selection Register */
#define GTM_CCM4_TIM_AUX_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC*)0xF01E29E0u)

/** \brief E29E4, CCM4 External Capture Trigger Enable Register */
#define GTM_CCM4_EXT_CAP_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN*)0xF01E29E4u)

/** \brief E29E8, CCM4 TOM Output Level Register */
#define GTM_CCM4_TOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT*)0xF01E29E8u)

/** \brief E29EC, CCM4 ATOM Output Level Register */
#define GTM_CCM4_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E29ECu)

/** \brief E29F0, CCM4 CMU Clock Configuration Register */
#define GTM_CCM4_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E29F0u)

