HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief E29F4, CCM4 CMU Fixed Clock Configuration Register */
#define GTM_CCM4_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E29F4u)

/** \brief E29F8, CCM4 Configuration Register */
#define GTM_CCM4_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E29F8u)

/** \brief E29FC, CCM4 Protection Register */
#define GTM_CCM4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E29FCu)

/** \brief E2A00, CCM5 Address Range Protector 0 Control Register */
#define GTM_CCM5_ARP0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A00u)

/** \brief E2A04, CCM5 Address Range Protector 0 Protection Register */
#define GTM_CCM5_ARP0_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A04u)

/** \brief E2A08, CCM5 Address Range Protector 1 Control Register */
#define GTM_CCM5_ARP1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A08u)

/** \brief E2A0C, CCM5 Address Range Protector 1 Protection Register */
#define GTM_CCM5_ARP1_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A0Cu)

/** \brief E2A10, CCM5 Address Range Protector 2 Control Register */
#define GTM_CCM5_ARP2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A10u)

/** \brief E2A14, CCM5 Address Range Protector 2 Protection Register */
#define GTM_CCM5_ARP2_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A14u)

/** \brief E2A18, CCM5 Address Range Protector 3 Control Register */
#define GTM_CCM5_ARP3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A18u)

/** \brief E2A1C, CCM5 Address Range Protector 3 Protection Register */
#define GTM_CCM5_ARP3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A1Cu)

/** \brief E2A20, CCM5 Address Range Protector 4 Control Register */
#define GTM_CCM5_ARP4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A20u)

/** \brief E2A24, CCM5 Address Range Protector 4 Protection Register */
#define GTM_CCM5_ARP4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A24u)

/** \brief E2A28, CCM5 Address Range Protector 5 Control Register */
#define GTM_CCM5_ARP5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A28u)

/** \brief E2A2C, CCM5 Address Range Protector 5 Protection Register */
#define GTM_CCM5_ARP5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A2Cu)

/** \brief E2A30, CCM5 Address Range Protector 6 Control Register */
#define GTM_CCM5_ARP6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A30u)

/** \brief E2A34, CCM5 Address Range Protector 6 Protection Register */
#define GTM_CCM5_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A34u)

/** \brief E2A38, CCM5 Address Range Protector 7 Control Register */
#define GTM_CCM5_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A38u)

/** \brief E2A3C, CCM5 Address Range Protector 7 Protection Register */
#define GTM_CCM5_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A3Cu)

/** \brief E2A40, CCM5 Address Range Protector 8 Control Register */
#define GTM_CCM5_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A40u)

/** \brief E2A44, CCM5 Address Range Protector 8 Protection Register */
#define GTM_CCM5_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A44u)

/** \brief E2A48, CCM5 Address Range Protector 9 Control Register */
#define GTM_CCM5_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2A48u)

/** \brief E2A4C, CCM5 Address Range Protector 9 Protection Register */
#define GTM_CCM5_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2A4Cu)

/** \brief E2BD8, CCM5 MCS Bus Master Status Register */
#define GTM_CCM5_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E2BD8u)

/** \brief E2BDC, CCM5 Hardware Configuration Register */
#define GTM_CCM5_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E2BDCu)

/** \brief E2BE0, CCM5 TIM Module AUX_IN Source Selection Register */
#define GTM_CCM5_TIM_AUX_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC*)0xF01E2BE0u)

/** \brief E2BE4, CCM5 External Capture Trigger Enable Register */
#define GTM_CCM5_EXT_CAP_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN*)0xF01E2BE4u)

/** \brief E2BEC, CCM5 ATOM Output Level Register */
#define GTM_CCM5_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E2BECu)

/** \brief E2BF0, CCM5 CMU Clock Configuration Register */
#define GTM_CCM5_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E2BF0u)

/** \brief E2BF4, CCM5 CMU Fixed Clock Configuration Register */
#define GTM_CCM5_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E2BF4u)

/** \brief E2BF8, CCM5 Configuration Register */
#define GTM_CCM5_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E2BF8u)

/** \brief E2BFC, CCM5 Protection Register */
#define GTM_CCM5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E2BFCu)

/** \brief E2C00, CCM6 Address Range Protector 0 Control Register */
#define GTM_CCM6_ARP0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C00u)

/** \brief E2C04, CCM6 Address Range Protector 0 Protection Register */
#define GTM_CCM6_ARP0_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C04u)

/** \brief E2C08, CCM6 Address Range Protector 1 Control Register */
#define GTM_CCM6_ARP1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C08u)

/** \brief E2C0C, CCM6 Address Range Protector 1 Protection Register */
#define GTM_CCM6_ARP1_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C0Cu)

/** \brief E2C10, CCM6 Address Range Protector 2 Control Register */
#define GTM_CCM6_ARP2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C10u)

