HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief E2C14, CCM6 Address Range Protector 2 Protection Register */
#define GTM_CCM6_ARP2_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C14u)

/** \brief E2C18, CCM6 Address Range Protector 3 Control Register */
#define GTM_CCM6_ARP3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C18u)

/** \brief E2C1C, CCM6 Address Range Protector 3 Protection Register */
#define GTM_CCM6_ARP3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C1Cu)

/** \brief E2C20, CCM6 Address Range Protector 4 Control Register */
#define GTM_CCM6_ARP4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C20u)

/** \brief E2C24, CCM6 Address Range Protector 4 Protection Register */
#define GTM_CCM6_ARP4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C24u)

/** \brief E2C28, CCM6 Address Range Protector 5 Control Register */
#define GTM_CCM6_ARP5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C28u)

/** \brief E2C2C, CCM6 Address Range Protector 5 Protection Register */
#define GTM_CCM6_ARP5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C2Cu)

/** \brief E2C30, CCM6 Address Range Protector 6 Control Register */
#define GTM_CCM6_ARP6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C30u)

/** \brief E2C34, CCM6 Address Range Protector 6 Protection Register */
#define GTM_CCM6_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C34u)

/** \brief E2C38, CCM6 Address Range Protector 7 Control Register */
#define GTM_CCM6_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C38u)

/** \brief E2C3C, CCM6 Address Range Protector 7 Protection Register */
#define GTM_CCM6_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C3Cu)

/** \brief E2C40, CCM6 Address Range Protector 8 Control Register */
#define GTM_CCM6_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C40u)

/** \brief E2C44, CCM6 Address Range Protector 8 Protection Register */
#define GTM_CCM6_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C44u)

/** \brief E2C48, CCM6 Address Range Protector 9 Control Register */
#define GTM_CCM6_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C48u)

/** \brief E2C4C, CCM6 Address Range Protector 9 Protection Register */
#define GTM_CCM6_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C4Cu)

/** \brief E2DD8, CCM6 MCS Bus Master Status Register */
#define GTM_CCM6_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E2DD8u)

/** \brief E2DDC, CCM6 Hardware Configuration Register */
#define GTM_CCM6_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E2DDCu)

/** \brief E2DE0, CCM6 TIM Module AUX_IN Source Selection Register */
#define GTM_CCM6_TIM_AUX_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC*)0xF01E2DE0u)

/** \brief E2DE4, CCM6 External Capture Trigger Enable Register */
#define GTM_CCM6_EXT_CAP_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN*)0xF01E2DE4u)

/** \brief E2DEC, CCM6 ATOM Output Level Register */
#define GTM_CCM6_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E2DECu)

/** \brief E2DF0, CCM6 CMU Clock Configuration Register */
#define GTM_CCM6_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E2DF0u)

/** \brief E2DF4, CCM6 CMU Fixed Clock Configuration Register */
#define GTM_CCM6_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E2DF4u)

/** \brief E2DF8, CCM6 Configuration Register */
#define GTM_CCM6_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E2DF8u)

/** \brief E2DFC, CCM6 Protection Register */
#define GTM_CCM6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E2DFCu)

/** \brief E2FDC, CCM7 Hardware Configuration Register */
#define GTM_CCM7_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E2FDCu)

/** \brief E2FEC, CCM7 ATOM Output Level Register */
#define GTM_CCM7_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E2FECu)

/** \brief E2FF0, CCM7 CMU Clock Configuration Register */
#define GTM_CCM7_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E2FF0u)

/** \brief E2FF4, CCM7 CMU Fixed Clock Configuration Register */
#define GTM_CCM7_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E2FF4u)

/** \brief E2FF8, CCM7 Configuration Register */
#define GTM_CCM7_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E2FF8u)

/** \brief E2FFC, CCM7 Protection Register */
#define GTM_CCM7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E2FFCu)

/** \brief E31DC, CCM8 Hardware Configuration Register */
#define GTM_CCM8_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E31DCu)

/** \brief E31EC, CCM8 ATOM Output Level Register */
#define GTM_CCM8_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E31ECu)

/** \brief E31F0, CCM8 CMU Clock Configuration Register */
#define GTM_CCM8_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E31F0u)

/** \brief E31F4, CCM8 CMU Fixed Clock Configuration Register */
#define GTM_CCM8_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E31F4u)

/** \brief E31F8, CCM8 Configuration Register */
#define GTM_CCM8_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E31F8u)

/** \brief E31FC, CCM8 Protection Register */
#define GTM_CCM8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E31FCu)

/** \brief E4000, CDTM0 DTM0 Global Configuration and Control Register */
#define GTM_CDTM0_DTM0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL*)0xF01E4000u)

/** \brief E4004, CDTM0 DTM0 Channel Control Register 1 */
#define GTM_CDTM0_DTM0_CH_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1*)0xF01E4004u)

/** \brief E4008, CDTM0 DTM0 Channel Control Register 2 */
#define GTM_CDTM0_DTM0_CH_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2*)0xF01E4008u)

/** \brief E400C, CDTM0 DTM0 Channel Control Register 2 Shadow */
#define GTM_CDTM0_DTM0_CH_CTRL2_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR*)0xF01E400Cu)

