HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief EA304, ATOM4 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM4_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA304u)

/** \brief EA304, ATOM4 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM4_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA304u)

/** \brief EA304, ATOM4 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM4_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA304u)

/** \brief EA308, ATOM4 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA308u)

/** \brief EA30C, ATOM4 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA30Cu)

/** \brief EA310, ATOM4 Channel 6 CCU0 Compare Register */
#define GTM_ATOM4_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA310u)

/** \brief EA314, ATOM4 Channel 6 CCU1 Compare Register */
#define GTM_ATOM4_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA314u)

/** \brief EA318, ATOM4 Channel 6 CCU0 Counter Register */
#define GTM_ATOM4_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA318u)

/** \brief EA31C, ATOM4 Channel 6 Status Register */
#define GTM_ATOM4_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA31Cu)

/** \brief EA320, ATOM4 Channel 6 Interrupt Notification Register */
#define GTM_ATOM4_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA320u)

/** \brief EA324, ATOM4 Channel 6 Interrupt Enable Register */
#define GTM_ATOM4_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA324u)

/** \brief EA328, ATOM4 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM4_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA328u)

/** \brief EA32C, ATOM4 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA32Cu)

/** \brief EA380, ATOM4 Channel 7 ARU read address Register */
#define GTM_ATOM4_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA380u)

/** \brief EA384, ATOM4 Channel 7 Control Register */
#define GTM_ATOM4_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA384u)

/** \brief EA384, ATOM4 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM4_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA384u)

/** \brief EA384, ATOM4 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM4_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA384u)

/** \brief EA384, ATOM4 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM4_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA384u)

/** \brief EA384, ATOM4 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM4_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA384u)

/** \brief EA384, ATOM4 Channel 7 Control Register in SOMS Mode */
#define GTM_ATOM4_CH7_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA384u)

/** \brief EA388, ATOM4 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA388u)

/** \brief EA38C, ATOM4 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA38Cu)

/** \brief EA390, ATOM4 Channel 7 CCU0 Compare Register */
#define GTM_ATOM4_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA390u)

/** \brief EA394, ATOM4 Channel 7 CCU1 Compare Register */
#define GTM_ATOM4_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA394u)

/** \brief EA398, ATOM4 Channel 7 CCU0 Counter Register */
#define GTM_ATOM4_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA398u)

/** \brief EA39C, ATOM4 Channel 7 Status Register */
#define GTM_ATOM4_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA39Cu)

/** \brief EA3A0, ATOM4 Channel 7 Interrupt Notification Register */
#define GTM_ATOM4_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA3A0u)

/** \brief EA3A4, ATOM4 Channel 7 Interrupt Enable Register */
#define GTM_ATOM4_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA3A4u)

/** \brief EA3A8, ATOM4 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM4_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA3A8u)

/** \brief EA3AC, ATOM4 Channel 7 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA3ACu)

/** \brief EA800, ATOM5 Channel 0 ARU read address Register */
#define GTM_ATOM5_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA800u)

/** \brief EA804, ATOM5 Channel 0 Control Register */
#define GTM_ATOM5_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA804u)

/** \brief EA804, ATOM5 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM5_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA804u)

/** \brief EA804, ATOM5 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM5_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA804u)

/** \brief EA804, ATOM5 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM5_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA804u)

/** \brief EA804, ATOM5 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM5_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA804u)

/** \brief EA804, ATOM5 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM5_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA804u)

/** \brief EA808, ATOM5 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA808u)

/** \brief EA80C, ATOM5 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA80Cu)

/** \brief EA810, ATOM5 Channel 0 CCU0 Compare Register */
#define GTM_ATOM5_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA810u)

/** \brief EA814, ATOM5 Channel 0 CCU1 Compare Register */
#define GTM_ATOM5_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA814u)

/** \brief EA818, ATOM5 Channel 0 CCU0 Counter Register */
#define GTM_ATOM5_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA818u)

/** \brief EA81C, ATOM5 Channel 0 Status Register */
#define GTM_ATOM5_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA81Cu)

/** \brief EA820, ATOM5 Channel 0 Interrupt Notification Register */
#define GTM_ATOM5_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA820u)

/** \brief EA824, ATOM5 Channel 0 Interrupt Enable Register */
#define GTM_ATOM5_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA824u)

/** \brief EA828, ATOM5 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM5_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA828u)

/** \brief EA82C, ATOM5 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA82Cu)

/** \brief EA840, ATOM5 AGC Global Control Register */
#define GTM_ATOM5_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01EA840u)

/** \brief EA844, ATOM5 AGC Enable/Disable Control Register */
#define GTM_ATOM5_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01EA844u)

/** \brief EA848, ATOM5 AGC Enable/Disable Status Register */
#define GTM_ATOM5_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01EA848u)

/** \brief EA84C, ATOM5 AGC Action Time Base Register */
#define GTM_ATOM5_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01EA84Cu)

/** \brief EA850, ATOM5 AGC Output Enable Control Register */
#define GTM_ATOM5_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01EA850u)

/** \brief EA854, ATOM5 AGC Output Enable Status Register */
#define GTM_ATOM5_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01EA854u)

/** \brief EA858, ATOM5 AGC Force Update Control Register */
#define GTM_ATOM5_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01EA858u)

/** \brief EA85C, ATOM5 AGC Internal Trigger Control Register */
#define GTM_ATOM5_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01EA85Cu)

