HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief EA880, ATOM5 Channel 1 ARU read address Register */
#define GTM_ATOM5_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA880u)

/** \brief EA884, ATOM5 Channel 1 Control Register */
#define GTM_ATOM5_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA884u)

/** \brief EA884, ATOM5 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM5_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA884u)

/** \brief EA884, ATOM5 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM5_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA884u)

/** \brief EA884, ATOM5 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM5_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA884u)

/** \brief EA884, ATOM5 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM5_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA884u)

/** \brief EA884, ATOM5 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM5_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA884u)

/** \brief EA888, ATOM5 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA888u)

/** \brief EA88C, ATOM5 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA88Cu)

/** \brief EA890, ATOM5 Channel 1 CCU0 Compare Register */
#define GTM_ATOM5_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA890u)

/** \brief EA894, ATOM5 Channel 1 CCU1 Compare Register */
#define GTM_ATOM5_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA894u)

/** \brief EA898, ATOM5 Channel 1 CCU0 Counter Register */
#define GTM_ATOM5_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA898u)

/** \brief EA89C, ATOM5 Channel 1 Status Register */
#define GTM_ATOM5_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA89Cu)

/** \brief EA8A0, ATOM5 Channel 1 Interrupt Notification Register */
#define GTM_ATOM5_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA8A0u)

/** \brief EA8A4, ATOM5 Channel 1 Interrupt Enable Register */
#define GTM_ATOM5_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA8A4u)

/** \brief EA8A8, ATOM5 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM5_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA8A8u)

/** \brief EA8AC, ATOM5 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA8ACu)

/** \brief EA900, ATOM5 Channel 2 ARU read address Register */
#define GTM_ATOM5_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA900u)

/** \brief EA904, ATOM5 Channel 2 Control Register */
#define GTM_ATOM5_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA904u)

/** \brief EA904, ATOM5 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM5_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA904u)

/** \brief EA904, ATOM5 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM5_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA904u)

/** \brief EA904, ATOM5 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM5_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA904u)

/** \brief EA904, ATOM5 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM5_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA904u)

/** \brief EA904, ATOM5 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM5_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA904u)

/** \brief EA908, ATOM5 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA908u)

/** \brief EA90C, ATOM5 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA90Cu)

/** \brief EA910, ATOM5 Channel 2 CCU0 Compare Register */
#define GTM_ATOM5_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA910u)

/** \brief EA914, ATOM5 Channel 2 CCU1 Compare Register */
#define GTM_ATOM5_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA914u)

/** \brief EA918, ATOM5 Channel 2 CCU0 Counter Register */
#define GTM_ATOM5_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA918u)

/** \brief EA91C, ATOM5 Channel 2 Status Register */
#define GTM_ATOM5_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA91Cu)

/** \brief EA920, ATOM5 Channel 2 Interrupt Notification Register */
#define GTM_ATOM5_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA920u)

/** \brief EA924, ATOM5 Channel 2 Interrupt Enable Register */
#define GTM_ATOM5_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA924u)

/** \brief EA928, ATOM5 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM5_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA928u)

/** \brief EA92C, ATOM5 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA92Cu)

/** \brief EA980, ATOM5 Channel 3 ARU read address Register */
#define GTM_ATOM5_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA980u)

/** \brief EA984, ATOM5 Channel 3 Control Register */
#define GTM_ATOM5_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA984u)

/** \brief EA984, ATOM5 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM5_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA984u)

