HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief EB804, ATOM7 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM7_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB804u)

/** \brief EB804, ATOM7 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM7_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB804u)

/** \brief EB804, ATOM7 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM7_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB804u)

/** \brief EB804, ATOM7 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM7_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB804u)

/** \brief EB804, ATOM7 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM7_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB804u)

/** \brief EB808, ATOM7 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB808u)

/** \brief EB80C, ATOM7 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB80Cu)

/** \brief EB810, ATOM7 Channel 0 CCU0 Compare Register */
#define GTM_ATOM7_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB810u)

/** \brief EB814, ATOM7 Channel 0 CCU1 Compare Register */
#define GTM_ATOM7_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB814u)

/** \brief EB818, ATOM7 Channel 0 CCU0 Counter Register */
#define GTM_ATOM7_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB818u)

/** \brief EB81C, ATOM7 Channel 0 Status Register */
#define GTM_ATOM7_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB81Cu)

/** \brief EB820, ATOM7 Channel 0 Interrupt Notification Register */
#define GTM_ATOM7_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB820u)

/** \brief EB824, ATOM7 Channel 0 Interrupt Enable Register */
#define GTM_ATOM7_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB824u)

/** \brief EB828, ATOM7 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM7_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB828u)

/** \brief EB82C, ATOM7 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB82Cu)

/** \brief EB840, ATOM7 AGC Global Control Register */
#define GTM_ATOM7_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01EB840u)

/** \brief EB844, ATOM7 AGC Enable/Disable Control Register */
#define GTM_ATOM7_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01EB844u)

/** \brief EB848, ATOM7 AGC Enable/Disable Status Register */
#define GTM_ATOM7_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01EB848u)

/** \brief EB84C, ATOM7 AGC Action Time Base Register */
#define GTM_ATOM7_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01EB84Cu)

/** \brief EB850, ATOM7 AGC Output Enable Control Register */
#define GTM_ATOM7_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01EB850u)

/** \brief EB854, ATOM7 AGC Output Enable Status Register */
#define GTM_ATOM7_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01EB854u)

/** \brief EB858, ATOM7 AGC Force Update Control Register */
#define GTM_ATOM7_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01EB858u)

/** \brief EB85C, ATOM7 AGC Internal Trigger Control Register */
#define GTM_ATOM7_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01EB85Cu)

/** \brief EB880, ATOM7 Channel 1 ARU read address Register */
#define GTM_ATOM7_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB880u)

/** \brief EB884, ATOM7 Channel 1 Control Register */
#define GTM_ATOM7_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB884u)

/** \brief EB884, ATOM7 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM7_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB884u)

/** \brief EB884, ATOM7 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM7_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB884u)

/** \brief EB884, ATOM7 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM7_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB884u)

/** \brief EB884, ATOM7 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM7_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB884u)

/** \brief EB884, ATOM7 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM7_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB884u)

/** \brief EB888, ATOM7 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB888u)

/** \brief EB88C, ATOM7 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB88Cu)

/** \brief EB890, ATOM7 Channel 1 CCU0 Compare Register */
#define GTM_ATOM7_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB890u)

/** \brief EB894, ATOM7 Channel 1 CCU1 Compare Register */
#define GTM_ATOM7_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB894u)

/** \brief EB898, ATOM7 Channel 1 CCU0 Counter Register */
#define GTM_ATOM7_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB898u)

/** \brief EB89C, ATOM7 Channel 1 Status Register */
#define GTM_ATOM7_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB89Cu)

/** \brief EB8A0, ATOM7 Channel 1 Interrupt Notification Register */
#define GTM_ATOM7_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB8A0u)

/** \brief EB8A4, ATOM7 Channel 1 Interrupt Enable Register */
#define GTM_ATOM7_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB8A4u)

