HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief F33BC, MCS3 Channel 7 Memory High Byte Register */
#define GTM_MCS3_CH7_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F33BCu)

/** \brief F33C0, MCS3 Channel 7 Program Counter Register */
#define GTM_MCS3_CH7_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F33C0u)

/** \brief F33C4, MCS3 Channel 7 Interrupt Notification Register */
#define GTM_MCS3_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F33C4u)

/** \brief F33C8, MCS3 Channel 7 Interrupt Enable Register */
#define GTM_MCS3_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F33C8u)

/** \brief F33CC, MCS3 Channel 7 Force Interrupt Register */
#define GTM_MCS3_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F33CCu)

/** \brief F33D0, MCS3 Channel 7 Interrupt Mode Configuration Register */
#define GTM_MCS3_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F33D0u)

/** \brief F33D4, MCS3 Channel 7 Error Interrupt Enable Register */
#define GTM_MCS3_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F33D4u)

/** \brief F4000, MCS4 Channel 0 General Purpose Register 0 */
#define GTM_MCS4_CH0_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4000u)

/** \brief F4004, MCS4 Channel 0 General Purpose Register 1 */
#define GTM_MCS4_CH0_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4004u)

/** \brief F4008, MCS4 Channel 0 General Purpose Register 2 */
#define GTM_MCS4_CH0_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4008u)

/** \brief F400C, MCS4 Channel 0 General Purpose Register 3 */
#define GTM_MCS4_CH0_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F400Cu)

/** \brief F4010, MCS4 Channel 0 General Purpose Register 4 */
#define GTM_MCS4_CH0_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4010u)

/** \brief F4014, MCS4 Channel 0 General Purpose Register 5 */
#define GTM_MCS4_CH0_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4014u)

/** \brief F4018, MCS4 Channel 0 General Purpose Register 6 */
#define GTM_MCS4_CH0_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4018u)

/** \brief F401C, MCS4 Channel 0 General Purpose Register 7 */
#define GTM_MCS4_CH0_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F401Cu)

/** \brief F4020, MCS4 Channel 0 Control Register */
#define GTM_MCS4_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F4020u)

/** \brief F4024, MCS4 Channel 0 ARU Control Bit Register */
#define GTM_MCS4_CH0_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F4024u)

/** \brief F4028, MCS4 Clear Trigger Control Register */
#define GTM_MCS4_CH0_CTRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRG*)0xF01F4028u)
/** Alias (User Manual Name) for GTM_MCS4_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS4_CH0_CTRG.
*/
#define GTM_MCS4_CTRG (GTM_MCS4_CH0_CTRG)

/** \brief F402C, MCS4 Set Trigger Control Register */
#define GTM_MCS4_CH0_STRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_STRG*)0xF01F402Cu)
/** Alias (User Manual Name) for GTM_MCS4_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS4_CH0_STRG.
*/
#define GTM_MCS4_STRG (GTM_MCS4_CH0_STRG)

/** \brief F403C, MCS4 Channel 0 Memory High Byte Register */
#define GTM_MCS4_CH0_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F403Cu)

/** \brief F4040, MCS4 Channel 0 Program Counter Register */
#define GTM_MCS4_CH0_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F4040u)

/** \brief F4044, MCS4 Channel 0 Interrupt Notification Register */
#define GTM_MCS4_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F4044u)

/** \brief F4048, MCS4 Channel 0 Interrupt Enable Register */
#define GTM_MCS4_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F4048u)

/** \brief F404C, MCS4 Channel 0 Force Interrupt Register */
#define GTM_MCS4_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F404Cu)

/** \brief F4050, MCS4 Channel 0 Interrupt Mode Configuration Register */
#define GTM_MCS4_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F4050u)

/** \brief F4054, MCS4 Channel 0 Error Interrupt Enable Register */
#define GTM_MCS4_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F4054u)

/** \brief F4060, MCS4 Write Protection Register */
#define GTM_MCS4_REG_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_REG_PROT*)0xF01F4060u)

/** \brief F4064, MCS4 Control and Status Register */
#define GTM_MCS4_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F4064u)

/** \brief F4068, MCS4 Reset Register */
#define GTM_MCS4_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F4068u)

/** \brief F406C, MCS4 Cancel ARU Transfer Instruction Register */
#define GTM_MCS4_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F406Cu)

/** \brief F4070, MCS4 Cancel WURM Instruction Register */
#define GTM_MCS4_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F4070u)

/** \brief F407C, MCS4 error register */
#define GTM_MCS4_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F407Cu)

/** \brief F4080, MCS4 Channel 1 General Purpose Register 0 */
#define GTM_MCS4_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4080u)

/** \brief F4084, MCS4 Channel 1 General Purpose Register 1 */
#define GTM_MCS4_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4084u)

/** \brief F4088, MCS4 Channel 1 General Purpose Register 2 */
#define GTM_MCS4_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4088u)

/** \brief F408C, MCS4 Channel 1 General Purpose Register 3 */
#define GTM_MCS4_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F408Cu)

