HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief F41A0, MCS4 Channel 3 Control Register */
#define GTM_MCS4_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F41A0u)

/** \brief F41A4, MCS4 Channel 3 ARU Control Bit Register */
#define GTM_MCS4_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F41A4u)

/** \brief F41BC, MCS4 Channel 3 Memory High Byte Register */
#define GTM_MCS4_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F41BCu)

/** \brief F41C0, MCS4 Channel 3 Program Counter Register */
#define GTM_MCS4_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F41C0u)

/** \brief F41C4, MCS4 Channel 3 Interrupt Notification Register */
#define GTM_MCS4_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F41C4u)

/** \brief F41C8, MCS4 Channel 3 Interrupt Enable Register */
#define GTM_MCS4_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F41C8u)

/** \brief F41CC, MCS4 Channel 3 Force Interrupt Register */
#define GTM_MCS4_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F41CCu)

/** \brief F41D0, MCS4 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS4_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F41D0u)

/** \brief F41D4, MCS4 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS4_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F41D4u)

/** \brief F4200, MCS4 Channel 4 General Purpose Register 0 */
#define GTM_MCS4_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4200u)

/** \brief F4204, MCS4 Channel 4 General Purpose Register 1 */
#define GTM_MCS4_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4204u)

/** \brief F4208, MCS4 Channel 4 General Purpose Register 2 */
#define GTM_MCS4_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4208u)

/** \brief F420C, MCS4 Channel 4 General Purpose Register 3 */
#define GTM_MCS4_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F420Cu)

/** \brief F4210, MCS4 Channel 4 General Purpose Register 4 */
#define GTM_MCS4_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4210u)

/** \brief F4214, MCS4 Channel 4 General Purpose Register 5 */
#define GTM_MCS4_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4214u)

/** \brief F4218, MCS4 Channel 4 General Purpose Register 6 */
#define GTM_MCS4_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4218u)

/** \brief F421C, MCS4 Channel 4 General Purpose Register 7 */
#define GTM_MCS4_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F421Cu)

/** \brief F4220, MCS4 Channel 4 Control Register */
#define GTM_MCS4_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F4220u)

/** \brief F4224, MCS4 Channel 4 ARU Control Bit Register */
#define GTM_MCS4_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F4224u)

/** \brief F423C, MCS4 Channel 4 Memory High Byte Register */
#define GTM_MCS4_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F423Cu)

/** \brief F4240, MCS4 Channel 4 Program Counter Register */
#define GTM_MCS4_CH4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F4240u)

/** \brief F4244, MCS4 Channel 4 Interrupt Notification Register */
#define GTM_MCS4_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F4244u)

/** \brief F4248, MCS4 Channel 4 Interrupt Enable Register */
#define GTM_MCS4_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F4248u)

/** \brief F424C, MCS4 Channel 4 Force Interrupt Register */
#define GTM_MCS4_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F424Cu)

/** \brief F4250, MCS4 Channel 4 Interrupt Mode Configuration Register */
#define GTM_MCS4_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F4250u)

/** \brief F4254, MCS4 Channel 4 Error Interrupt Enable Register */
#define GTM_MCS4_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F4254u)

/** \brief F4280, MCS4 Channel 5 General Purpose Register 0 */
#define GTM_MCS4_CH5_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4280u)

/** \brief F4284, MCS4 Channel 5 General Purpose Register 1 */
#define GTM_MCS4_CH5_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4284u)

/** \brief F4288, MCS4 Channel 5 General Purpose Register 2 */
#define GTM_MCS4_CH5_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4288u)

/** \brief F428C, MCS4 Channel 5 General Purpose Register 3 */
#define GTM_MCS4_CH5_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F428Cu)

/** \brief F4290, MCS4 Channel 5 General Purpose Register 4 */
#define GTM_MCS4_CH5_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4290u)

/** \brief F4294, MCS4 Channel 5 General Purpose Register 5 */
#define GTM_MCS4_CH5_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4294u)

/** \brief F4298, MCS4 Channel 5 General Purpose Register 6 */
#define GTM_MCS4_CH5_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4298u)

/** \brief F429C, MCS4 Channel 5 General Purpose Register 7 */
#define GTM_MCS4_CH5_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F429Cu)

/** \brief F42A0, MCS4 Channel 5 Control Register */
#define GTM_MCS4_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F42A0u)

/** \brief F42A4, MCS4 Channel 5 ARU Control Bit Register */
#define GTM_MCS4_CH5_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F42A4u)

/** \brief F42BC, MCS4 Channel 5 Memory High Byte Register */
#define GTM_MCS4_CH5_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F42BCu)

/** \brief F42C0, MCS4 Channel 5 Program Counter Register */
#define GTM_MCS4_CH5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F42C0u)

/** \brief F42C4, MCS4 Channel 5 Interrupt Notification Register */
#define GTM_MCS4_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F42C4u)

/** \brief F42C8, MCS4 Channel 5 Interrupt Enable Register */
#define GTM_MCS4_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F42C8u)

