HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief F5010, MCS5 Channel 0 General Purpose Register 4 */
#define GTM_MCS5_CH0_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5010u)

/** \brief F5014, MCS5 Channel 0 General Purpose Register 5 */
#define GTM_MCS5_CH0_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5014u)

/** \brief F5018, MCS5 Channel 0 General Purpose Register 6 */
#define GTM_MCS5_CH0_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5018u)

/** \brief F501C, MCS5 Channel 0 General Purpose Register 7 */
#define GTM_MCS5_CH0_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F501Cu)

/** \brief F5020, MCS5 Channel 0 Control Register */
#define GTM_MCS5_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F5020u)

/** \brief F5024, MCS5 Channel 0 ARU Control Bit Register */
#define GTM_MCS5_CH0_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F5024u)

/** \brief F5028, MCS5 Clear Trigger Control Register */
#define GTM_MCS5_CH0_CTRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRG*)0xF01F5028u)
/** Alias (User Manual Name) for GTM_MCS5_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS5_CH0_CTRG.
*/
#define GTM_MCS5_CTRG (GTM_MCS5_CH0_CTRG)

/** \brief F502C, MCS5 Set Trigger Control Register */
#define GTM_MCS5_CH0_STRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_STRG*)0xF01F502Cu)
/** Alias (User Manual Name) for GTM_MCS5_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS5_CH0_STRG.
*/
#define GTM_MCS5_STRG (GTM_MCS5_CH0_STRG)

/** \brief F503C, MCS5 Channel 0 Memory High Byte Register */
#define GTM_MCS5_CH0_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F503Cu)

/** \brief F5040, MCS5 Channel 0 Program Counter Register */
#define GTM_MCS5_CH0_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F5040u)

/** \brief F5044, MCS5 Channel 0 Interrupt Notification Register */
#define GTM_MCS5_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F5044u)

/** \brief F5048, MCS5 Channel 0 Interrupt Enable Register */
#define GTM_MCS5_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F5048u)

/** \brief F504C, MCS5 Channel 0 Force Interrupt Register */
#define GTM_MCS5_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F504Cu)

/** \brief F5050, MCS5 Channel 0 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F5050u)

/** \brief F5054, MCS5 Channel 0 Error Interrupt Enable Register */
#define GTM_MCS5_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F5054u)

/** \brief F5060, MCS5 Write Protection Register */
#define GTM_MCS5_REG_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_REG_PROT*)0xF01F5060u)

/** \brief F5064, MCS5 Control and Status Register */
#define GTM_MCS5_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F5064u)

/** \brief F5068, MCS5 Reset Register */
#define GTM_MCS5_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F5068u)

/** \brief F506C, MCS5 Cancel ARU Transfer Instruction Register */
#define GTM_MCS5_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F506Cu)

/** \brief F5070, MCS5 Cancel WURM Instruction Register */
#define GTM_MCS5_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F5070u)

/** \brief F507C, MCS5 error register */
#define GTM_MCS5_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F507Cu)

/** \brief F5080, MCS5 Channel 1 General Purpose Register 0 */
#define GTM_MCS5_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5080u)

/** \brief F5084, MCS5 Channel 1 General Purpose Register 1 */
#define GTM_MCS5_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5084u)

/** \brief F5088, MCS5 Channel 1 General Purpose Register 2 */
#define GTM_MCS5_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5088u)

/** \brief F508C, MCS5 Channel 1 General Purpose Register 3 */
#define GTM_MCS5_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F508Cu)

/** \brief F5090, MCS5 Channel 1 General Purpose Register 4 */
#define GTM_MCS5_CH1_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5090u)

/** \brief F5094, MCS5 Channel 1 General Purpose Register 5 */
#define GTM_MCS5_CH1_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5094u)

/** \brief F5098, MCS5 Channel 1 General Purpose Register 6 */
#define GTM_MCS5_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5098u)

/** \brief F509C, MCS5 Channel 1 General Purpose Register 7 */
#define GTM_MCS5_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F509Cu)

/** \brief F50A0, MCS5 Channel 1 Control Register */
#define GTM_MCS5_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F50A0u)

/** \brief F50A4, MCS5 Channel 1 ARU Control Bit Register */
#define GTM_MCS5_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F50A4u)

/** \brief F50BC, MCS5 Channel 1 Memory High Byte Register */
#define GTM_MCS5_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F50BCu)

/** \brief F50C0, MCS5 Channel 1 Program Counter Register */
#define GTM_MCS5_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F50C0u)

/** \brief F50C4, MCS5 Channel 1 Interrupt Notification Register */
#define GTM_MCS5_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F50C4u)

/** \brief F50C8, MCS5 Channel 1 Interrupt Enable Register */
#define GTM_MCS5_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F50C8u)

/** \brief F50CC, MCS5 Channel 1 Force Interrupt Register */
#define GTM_MCS5_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F50CCu)

/** \brief F50D0, MCS5 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F50D0u)

