HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_reg.h
/** \brief F61A4, MCS6 Channel 3 ARU Control Bit Register */
#define GTM_MCS6_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F61A4u)

/** \brief F61BC, MCS6 Channel 3 Memory High Byte Register */
#define GTM_MCS6_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F61BCu)

/** \brief F61C0, MCS6 Channel 3 Program Counter Register */
#define GTM_MCS6_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F61C0u)

/** \brief F61C4, MCS6 Channel 3 Interrupt Notification Register */
#define GTM_MCS6_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F61C4u)

/** \brief F61C8, MCS6 Channel 3 Interrupt Enable Register */
#define GTM_MCS6_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F61C8u)

/** \brief F61CC, MCS6 Channel 3 Force Interrupt Register */
#define GTM_MCS6_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F61CCu)

/** \brief F61D0, MCS6 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F61D0u)

/** \brief F61D4, MCS6 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS6_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F61D4u)

/** \brief F6200, MCS6 Channel 4 General Purpose Register 0 */
#define GTM_MCS6_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6200u)

/** \brief F6204, MCS6 Channel 4 General Purpose Register 1 */
#define GTM_MCS6_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6204u)

/** \brief F6208, MCS6 Channel 4 General Purpose Register 2 */
#define GTM_MCS6_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6208u)

/** \brief F620C, MCS6 Channel 4 General Purpose Register 3 */
#define GTM_MCS6_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F620Cu)

/** \brief F6210, MCS6 Channel 4 General Purpose Register 4 */
#define GTM_MCS6_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6210u)

/** \brief F6214, MCS6 Channel 4 General Purpose Register 5 */
#define GTM_MCS6_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6214u)

/** \brief F6218, MCS6 Channel 4 General Purpose Register 6 */
#define GTM_MCS6_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6218u)

/** \brief F621C, MCS6 Channel 4 General Purpose Register 7 */
#define GTM_MCS6_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F621Cu)

/** \brief F6220, MCS6 Channel 4 Control Register */
#define GTM_MCS6_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F6220u)

/** \brief F6224, MCS6 Channel 4 ARU Control Bit Register */
#define GTM_MCS6_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F6224u)

/** \brief F623C, MCS6 Channel 4 Memory High Byte Register */
#define GTM_MCS6_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F623Cu)

/** \brief F6240, MCS6 Channel 4 Program Counter Register */
#define GTM_MCS6_CH4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F6240u)

/** \brief F6244, MCS6 Channel 4 Interrupt Notification Register */
#define GTM_MCS6_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F6244u)

/** \brief F6248, MCS6 Channel 4 Interrupt Enable Register */
#define GTM_MCS6_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F6248u)

/** \brief F624C, MCS6 Channel 4 Force Interrupt Register */
#define GTM_MCS6_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F624Cu)

/** \brief F6250, MCS6 Channel 4 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F6250u)

/** \brief F6254, MCS6 Channel 4 Error Interrupt Enable Register */
#define GTM_MCS6_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F6254u)

/** \brief F6280, MCS6 Channel 5 General Purpose Register 0 */
#define GTM_MCS6_CH5_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6280u)

/** \brief F6284, MCS6 Channel 5 General Purpose Register 1 */
#define GTM_MCS6_CH5_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6284u)

/** \brief F6288, MCS6 Channel 5 General Purpose Register 2 */
#define GTM_MCS6_CH5_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6288u)

/** \brief F628C, MCS6 Channel 5 General Purpose Register 3 */
#define GTM_MCS6_CH5_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F628Cu)

/** \brief F6290, MCS6 Channel 5 General Purpose Register 4 */
#define GTM_MCS6_CH5_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6290u)

/** \brief F6294, MCS6 Channel 5 General Purpose Register 5 */
#define GTM_MCS6_CH5_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6294u)

/** \brief F6298, MCS6 Channel 5 General Purpose Register 6 */
#define GTM_MCS6_CH5_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6298u)

/** \brief F629C, MCS6 Channel 5 General Purpose Register 7 */
#define GTM_MCS6_CH5_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F629Cu)

/** \brief F62A0, MCS6 Channel 5 Control Register */
#define GTM_MCS6_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F62A0u)

/** \brief F62A4, MCS6 Channel 5 ARU Control Bit Register */
#define GTM_MCS6_CH5_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F62A4u)

/** \brief F62BC, MCS6 Channel 5 Memory High Byte Register */
#define GTM_MCS6_CH5_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F62BCu)

/** \brief F62C0, MCS6 Channel 5 Program Counter Register */
#define GTM_MCS6_CH5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F62C0u)

/** \brief F62C4, MCS6 Channel 5 Interrupt Notification Register */
#define GTM_MCS6_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F62C4u)

/** \brief F62C8, MCS6 Channel 5 Interrupt Enable Register */
#define GTM_MCS6_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F62C8u)

/** \brief F62CC, MCS6 Channel 5 Force Interrupt Register */
#define GTM_MCS6_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F62CCu)

/** \brief F62D0, MCS6 Channel 5 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F62D0u)

/** \brief F62D4, MCS6 Channel 5 Error Interrupt Enable Register */
#define GTM_MCS6_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F62D4u)

/** \brief F6300, MCS6 Channel 6 General Purpose Register 0 */
#define GTM_MCS6_CH6_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6300u)

/** \brief F6304, MCS6 Channel 6 General Purpose Register 1 */
#define GTM_MCS6_CH6_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6304u)

